{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/d433eef4-91ac-4c2c-9f6f-877b992ad320')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/d433eef4-91ac-4c2c-9f6f-877b992ad320')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-09-01-preview",
            "properties": {
                "displayName": "Security Event log cleared",
                "description": "Checks for event id 1102 which indicates the security event log was cleared. \nIt uses Event Source Name \"Microsoft-Windows-Eventlog\" to avoid generating false positives from other sources, like AD FS servers for instance.",
                "severity": "Medium",
                "enabled": true,
                "query": "(union isfuzzy=true\n    (\n    SecurityEvent\n    | where EventID == 1102 and EventSourceName == \"Microsoft-Windows-Eventlog\" \n    | summarize\n        StartTimeUtc = min(TimeGenerated),\n        EndTimeUtc = max(TimeGenerated),\n        EventCount = count()\n        by Computer, Account, EventID, Activity\n    | extend\n        timestamp = StartTimeUtc,\n        AccountCustomEntity = Account,\n        HostCustomEntity = Computer\n    ),\n    (\n    WindowsEvent\n    | where EventID == 1102 and Provider == \"Microsoft-Windows-Eventlog\"  \n    | extend Account =  strcat(tostring(EventData.SubjectDomainName), \"\\\\\", tostring(EventData.SubjectUserName))\n    | extend Activity= \"1102 - The audit log was cleared.\"\n    |extend Account=\"azureuser\"\n    | summarize\n        StartTimeUtc = min(TimeGenerated),\n        EndTimeUtc = max(TimeGenerated),\n        EventCount = count()\n        by Computer, Account, EventID, Activity\n    | extend\n        timestamp = StartTimeUtc,\n        AccountCustomEntity = Account,\n        HostCustomEntity = Computer\n    )\n)\n |extend Account1=\"azureuser\"\n | extend AccountCustomEntity = Account1\n",
                "queryFrequency": "PT1H",
                "queryPeriod": "P3D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "tactics": [
                    "DefenseEvasion"
                ],
                "techniques": [
                    "T1070"
                ],
                "alertRuleTemplateName": "80da0a8f-cfe1-4cd0-a895-8bc1771a720e",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "AlertPerResult"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "AccountCustomEntity"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "HostCustomEntity"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null
            }
        }
    ]
}
